[{"title":"Monster Jam","description":"","tstart":"2016-01-09 19:00:00","tstop":"","venue":"Georgia Dome","price":"20.00 - 50.00 ","cityregion":"Atlanta,Georgia","latlong":"33.756529,-84.400996"},{"title":"Lucinda Williams","description":"","tstart":"2015-09-30 20:00:00","tstop":"","venue":"Variety Playhouse","price":"32.50 - 35.00 ","cityregion":"Atlanta,Georgia","latlong":"33.7635180,-84.3509360"},{"title":"Lucinda Williams","description":"","tstart":"2015-09-29 20:00:00","tstop":"","venue":"Variety Playhouse","price":"32.50 - 35.00 ","cityregion":"Atlanta,Georgia","latlong":"33.7635180,-84.3509360"},{"title":"Raheem DeVaughn & Leela James present the Love 'n Soul Experience","description":"","tstart":"2015-10-09 20:00:00","tstop":"","venue":"Symphony Hall Atlanta - Woodruff Arts Center","price":"29.50 - 49.50 ","cityregion":"Atlanta,Georgia","latlong":"33.78988082866555,-84.38613545581973"},{"title":"Aer with Cody Simpson","description":"","tstart":"2015-10-20 20:00:00","tstop":"","venue":"The Buckhead Theatre","price":"20.00 - 20.00 ","cityregion":"Atlanta,Georgia","latlong":"33.8402272,-84.3795437"},{"title":"Oddball Comedy and Curiosity Festival: Aziz Ansari and Amy Schumer","description":"","tstart":"2015-10-04 17:00:00","tstop":"","venue":"Aaron's Amphitheatre at Lakewood","price":"","cityregion":"Atlanta,Georgia","latlong":"33.7005910,-84.3888510"},{"title":"Yanni","description":" ","tstart":"2016-02-20 20:00:00","tstop":"","venue":"Fabulous Fox Theatre","price":"Visit website for price range.  ","cityregion":"Atlanta,Georgia","latlong":"33.7726151,-84.3855785"},{"title":"Monster Jam","description":"","tstart":"2016-03-05 19:00:00","tstop":"","venue":"Georgia Dome","price":"20.00 - 50.00 ","cityregion":"Atlanta,Georgia","latlong":"33.756529,-84.400996"},{"title":"Deerhunter","description":"","tstart":"2016-01-08 20:30:00","tstop":"","venue":"Variety Playhouse","price":"20.00 - 22.00 ","cityregion":"Atlanta,Georgia","latlong":"33.7635180,-84.3509360"},{"title":"K Michelle and Azealia Banks","description":"","tstart":"2015-10-02 19:00:00","tstop":"","venue":"Chastain Park Amphitheater","price":"25.00 - 55.50 ","cityregion":"Atlanta,Georgia","latlong":"33.8771140,-84.3970160"},{"title":"Janet Jackson","description":"","tstart":"2015-09-26 20:00:00","tstop":"","venue":"Chastain Park Amphitheater","price":"45.00 - 125.00 ","cityregion":"Atlanta,Georgia","latlong":"33.8771140,-84.3970160"},{"title":"Jodeci","description":"  ","tstart":"2015-10-03 20:00:00","tstop":"","venue":"Fabulous Fox Theatre","price":"Visit website for price range.  ","cityregion":"Atlanta,Georgia","latlong":"33.7726151,-84.3855785"},{"title":"Collective Soul","description":"","tstart":"2015-10-03 20:00:00","tstop":"","venue":"Tabernacle","price":"32.50 - 38.00 ","cityregion":"Atlanta,Georgia","latlong":"33.7589282,-84.3914776"},{"title":"Of Monsters and Men","description":"","tstart":"2015-10-09 20:00:00","tstop":"","venue":"Chastain Park Amphitheater","price":"22.50 - 38.50 ","cityregion":"Atlanta,Georgia","latlong":"33.8771140,-84.3970160"},{"title":"OWL CITY","description":" <em>• All Ages Welcome<br> • General Admission (first come, first served)<br> • Tickets available online via Ticketmaster.com or without ticket fees in person at the Center Stage Box Office, M-F, 11-6. Online sales end at 5pm on day of show.</em><br><br><br><br> No matter where he goes, Owl City mastermind Adam Young is constantly creating music. It doesn’t matter if he’s backstage before a gig or sitting in an airport terminal, the singer, songwriter, and multi-instrumentalist will typically be penning tunes on his laptop. His third fulllength album nods to that process with the highly apropos title Mobile Orchestra [Republic Records]. Following up his acclaimed 2012 studio album The Midsummer Station, the record sees Owl City progress once more, veering off the beaten path in the process.<br><br> “Mobile Orchestra is all about variety,” he asserts. “In the past, I’ve set out to make albums that were designed to be a singular listening experience, flowing from track to track. This time around, the songs are like ten rabbit holes that go off in different directions. I had never approached a record like this. I wanted to clear the slate and forget what I knew in order to create a new experience. I spent two years working on it, and it had the time to grow in between every idea. That’s why there’s so much going on.”<br><br> There was no rush for Owl City. These songs got the chance to evolve as he built them andthen sought out the right co-conspirators. The first single “Verge” merges his bright, buoyant production and shimmering vocals with a booming soulful refrain from Aloe Blacc. It blurs the lines between electro, alternative, pop, and R&B all at once, while remaining perfect for the dance floor.<br><br> “You’re thinking about those moments in life where you’re on the edge,” explains Adam. “It’s like the last day of your life as you know it, and tomorrow everything is going to change. It could be a college graduation. It could be a new career. It could be your wedding day. You’re not sure how it’s going to go, but you’re confident that you’re going to hit the ground running. We reached out to Aloe out of nowhere, and he was so gracious and kind to lend his incredible talent to the track.”<br><br> At the same time, the band steps completely outside the box altogether on “Back Home” with country star Jake Owen. “That’s probably my favorite because it was so fresh for me to try something else,” he admits. “I’ve done acoustic tracks before but never like this. I’ve been a big fan of Jake’s for a couple of years. I listened to a lot of his records, and he was a gateway into the country world. We married this pop sensibility with his voice and told a story about how it feels to come home—especially after a long trip or, in our case, tour.”<br><br> Then, there’s the love letter to all things nineties with none other than Hanson’s “Unbelievable.” Wanting to capture a nostalgia for the era, Adam reached out to the pop powerhouse, and they cooked up this jovial anthem. “That one is so much fun,” he says. “It goes through everything we love about that era, and Hanson fit perfectly.”<br><br> Elsewhere, “Thunderstruck” with UK trance diva Sarah Russell proves utterly propulsive and club-ready. As Adam assembled the music, the entire vision came into focus in late 2014 for Mobile Orchestra. “What each of these collaborators does is so different from what I do,” he continues. “It felt so right and natural to reach outside of my comfort zone and join forces with artists away from my world. That process was awesome. Once these people got on board, it really gave the project steam. The train was finally moving.”<br><br> The train really never stopped though. The Owatonna, Minnesota native remains an avant garde hit maker in his own right. With total album sales over 2.5 million and single sales surpassing 18 million globally, his smash “Fireflies” from 2009’s Ocean Eyes received a five times RIAA platinum certification in addition to going #1 in 26 countries. “Good Time” featuring Carly Rae Jepsen went Top 4 in the U.S. and racked up sales of close to three million. He composed the theme song for filmmaker Zack Snyder’s Legend of the Guardians: The Owls of Ga&#39;Hoole and an original tune for Disney’s Academy Award winner Wreck-It Ralph, while Owl City’s music has seen placements everywhere from The Croods and Veggietales to Smurfs 2.<br><br> Even with all of the collaborations on Mobile Orchestra, everything still stems from Adam’s vision in the end. “I’ve always got that laptop out,” he remarks. “You can do so much with layering, tones, and sounds. It’s literally like an orchestra in a box. If you just take the time to breathe life into it, it can be beautiful. <br><br><br>","tstart":"2015-10-06 20:00:00","tstop":"","venue":"Center Stage","price":"$25/Adv, $30 Day Of Show","cityregion":"Atlanta,Georgia","latlong":"33.7920338,-84.3879795"}]